- Pandas?
- Series?
- DataFrame?
- create df
- create/update columns
- vectorized operations
- change values
- .loc => filtering

In [4]:
from typing import List
# %conda install pandas # if you do not already have pandas
import pandas as pd

example_list: List[int] = [1,2,3,4,5]
type(example_list)

list

In [5]:
example_list.pop()

5

In [6]:
example_list

[1, 2, 3, 4]

In [8]:
s1 = pd.Series(example_list)
s1.index = ["A", "B", "C", "D"]

In [11]:
s1["A"] = 23

In [12]:
s1

A    23
B     2
C     3
D     4
dtype: int64

In [13]:
s1.index = range(4)
s1

0    23
1     2
2     3
3     4
dtype: int64

In [16]:
# Create df from dictionary
names = ["Nate", "Rebecca", "Edwin", "Preston"]
ages = [39, 40, 11, 7]
year = ["senior", "junior", "sophomore", "freshman"]

students = {
    "name": names,
    "age": ages,
    "year": year
}
students_df = pd.DataFrame(students)
students_df

      name  age       year
0     Nate   39     senior
1  Rebecca   40     junior
2    Edwin   11  sophomore
3  Preston    7   freshman

In [23]:
import random
# Create df from list of rows

players = ["Messi", "Mbappe", "Ronaldo", "Sala"]

cols = ["name", "goals/game", "games"]
data = [
    [player, random.random(), round(random.random() * 1000)] 
    for player in players
    ]
players_df = pd.DataFrame(data=data, columns=cols)
players_df

      name  goals/game  games
0    Messi    0.300468    198
1   Mbappe    0.509600    223
2  Ronaldo    0.338200    595
3     Sala    0.332454    637

In [24]:
# create/update columns
players_df["name"]

0      Messi
1     Mbappe
2    Ronaldo
3       Sala
Name: name, dtype: str

In [25]:
players_df["name"][0]

'Messi'

In [ ]:
players_df["new_col"] = 0
players_df

      name  goals/game  games  new_col
0    Messi    0.300468    198        0
1   Mbappe    0.509600    223        0
2  Ronaldo    0.338200    595        0
3     Sala    0.332454    637        0

In [ ]:
players_df["new_col"] = [i+1 for i in range(len(players_df))]
players_df

      name  goals/game  games  new_col
0    Messi    0.300468    198        1
1   Mbappe    0.509600    223        2
2  Ronaldo    0.338200    595        3
3     Sala    0.332454    637        4

In [33]:
len(players_df)

4

In [28]:
players_df.shape

(4, 4)

In [35]:
players_df["new_col"] = players_df["goals/game"] * players_df["games"]
players_df

      name  goals/game  games     new_col
0    Messi    0.300468    198   59.492664
1   Mbappe    0.509600    223  113.640881
2  Ronaldo    0.338200    595  201.229187
3     Sala    0.332454    637  211.773414

In [37]:
# inline vs declarative
# players_df.rename(columns={"new_col": "goals"}, inplace=True)
players_df = players_df.rename(columns={"new_col": "goals"})
players_df

      name  goals/game  games       goals
0    Messi    0.300468    198   59.492664
1   Mbappe    0.509600    223  113.640881
2  Ronaldo    0.338200    595  201.229187
3     Sala    0.332454    637  211.773414

In [38]:
players_df["name"] = players_df["name"].str.lower()
players_df

      name  goals/game  games       goals
0    messi    0.300468    198   59.492664
1   mbappe    0.509600    223  113.640881
2  ronaldo    0.338200    595  201.229187
3     sala    0.332454    637  211.773414

In [42]:
players_df[["name", "goals"]]

      name       goals
0    messi   59.492664
1   mbappe  113.640881
2  ronaldo  201.229187
3     sala  211.773414

In [43]:
# .loc[]

players_df = players_df.set_index("name")
players_df

         goals/game  games       goals
name
messi      0.300468    198   59.492664
mbappe     0.509600    223  113.640881
ronaldo    0.338200    595  201.229187
sala       0.332454    637  211.773414

In [44]:
players_df.loc["mbappe", "games"]

np.int64(223)

In [45]:
players_df = players_df.reset_index()
players_df

      name  goals/game  games       goals
0    messi    0.300468    198   59.492664
1   mbappe    0.509600    223  113.640881
2  ronaldo    0.338200    595  201.229187
3     sala    0.332454    637  211.773414

In [46]:
players_df.loc[0]

name              messi
goals/game     0.300468
games               198
goals         59.492664
Name: 0, dtype: object

In [47]:
players_df.loc[1:2,"games":"goals"]

   games       goals
1    223  113.640881
2    595  201.229187

In [49]:
players_df.loc[[0,3,2]]

      name  goals/game  games       goals
0    messi    0.300468    198   59.492664
3     sala    0.332454    637  211.773414
2  ronaldo    0.338200    595  201.229187

In [50]:
players_df.loc[players_df["goals/game"]>0.5]

     name  goals/game  games       goals
1  mbappe      0.5096    223  113.640881

In [51]:
players_df.loc[players_df["goals/game"]>0.5, "name"]

1    mbappe
Name: name, dtype: str

In [52]:
players_df.loc[players_df["goals/game"]>0.5, "name"] = "MBAPPE"

In [53]:
players_df

      name  goals/game  games       goals
0    messi    0.300468    198   59.492664
1   MBAPPE    0.509600    223  113.640881
2  ronaldo    0.338200    595  201.229187
3     sala    0.332454    637  211.773414

In [54]:
players_df['team'] = ["FC Barca", "PSG", "PSG", "Liverpool"]
players_df

      name  goals/game  games       goals       team
0    messi    0.300468    198   59.492664   FC Barca
1   MBAPPE    0.509600    223  113.640881        PSG
2  ronaldo    0.338200    595  201.229187        PSG
3     sala    0.332454    637  211.773414  Liverpool

In [56]:
players_df.loc[players_df["team"] == "PSG", "team"] = "Paris St. Germain"
players_df

      name  goals/game  games       goals               team
0    messi    0.300468    198   59.492664           FC Barca
1   MBAPPE    0.509600    223  113.640881  Paris St. Germain
2  ronaldo    0.338200    595  201.229187  Paris St. Germain
3     sala    0.332454    637  211.773414          Liverpool